serving/results/llama_qwen_ds/logs/benchmarks/baseline__models_qwen2_5_coder_7b_instruct.log

==================================
Running benchmarks (baseline / qwen)
==================================

==================================
Target: qwen
Port: 12306
Model: /models/Qwen2.5-Coder-7B-Instruct
==================================
RPS=7
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 14:55:05][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 14:55:06 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 14:55:10][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:55:10][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 14:55:12.814000 15223 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 14:55:12.814000 15223 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 14:55:13][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:55:13][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:55:13][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:55:13][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x78a433548680>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=7.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 14:55:13 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 587:33:20 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 7.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:41<00:00,  5.99it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           7.00      
Benchmark duration (s):                  41.75     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              5.99      
Output token throughput (tok/s):         5389.22   
Peak output token throughput (tok/s):    7215.00   
Peak concurrent requests:                57.00     
Total Token throughput (tok/s):          5987.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          448.74    
Median TTFT (ms):                        28.83     
P95 TTFT (ms):                           2111.03   
P99 TTFT (ms):                           2665.01   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          5.94      
Median TPOT (ms):                        5.62      
P95 TPOT (ms):                           8.04      
P99 TPOT (ms):                           8.27      
---------------Inter-token Latency----------------
Mean ITL (ms):                           5.94      
Median ITL (ms):                         5.09      
P95 ITL (ms):                            6.42      
P99 ITL (ms):                            20.14     
==================================================
RPS=10
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 14:56:03][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 14:56:04 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 14:56:08][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:56:08][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 14:56:11.117000 15744 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 14:56:11.117000 15744 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 14:56:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:56:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:56:11][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:56:11][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75c8a87405e0>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 14:56:12 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 494:55:41 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:40<00:00,  6.23it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  40.14     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              6.23      
Output token throughput (tok/s):         5605.34   
Peak output token throughput (tok/s):    9336.00   
Peak concurrent requests:                113.00    
Total Token throughput (tok/s):          6227.63   
---------------Time to First Token----------------
Mean TTFT (ms):                          1791.22   
Median TTFT (ms):                        1396.60   
P95 TTFT (ms):                           4733.41   
P99 TTFT (ms):                           5761.31   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.05      
Median TPOT (ms):                        9.46      
P95 TPOT (ms):                           13.56     
P99 TPOT (ms):                           14.11     
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.05      
Median ITL (ms):                         5.33      
P95 ITL (ms):                            7.15      
P99 ITL (ms):                            22.38     
==================================================
RPS=15
/usr/local/lib/python3.11/dist-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
[kvcached][INFO][2026-08-19 14:56:59][patch_base.py:98] Applying 6 patches for vllm
INFO 08-19 14:57:00 [__init__.py:216] Automatically detected platform cuda.
[kvcached][INFO][2026-08-19 14:57:04][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:57:04][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
W0819 14:57:07.136000 16136 torch/utils/cpp_extension.py:2425] TORCH_CUDA_ARCH_LIST is not set, all archs for visible cards are included for compilation. 
W0819 14:57:07.136000 16136 torch/utils/cpp_extension.py:2425] If this is not desired, please set os.environ['TORCH_CUDA_ARCH_LIST'] to specific architectures.
[kvcached][INFO][2026-08-19 14:57:07][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:57:07][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:57:07][version_utils.py:189] Detected vllm version: 0.11.1.dev14+gf0dd2fcb6.d20260712
[kvcached][INFO][2026-08-19 14:57:07][patch_base.py:178] Successfully patched vllm: elastic_block_pool, engine_core, gpu_model_runner, gpu_worker, kv_cache_coordinator
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7e698e9b4680>, seed=0, num_prompts=250, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=900, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=12306, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen2.5-Coder-7B-Instruct', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=15.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 08-19 14:57:08 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [900, 900]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:03 elapsed, 538:57:17 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 15.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 250/250 [00:38<00:00,  6.49it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     250       
Request rate configured (RPS):           15.00     
Benchmark duration (s):                  38.54     
Total input tokens:                      24979     
Total generated tokens:                  225000    
Request throughput (req/s):              6.49      
Output token throughput (tok/s):         5838.35   
Peak output token throughput (tok/s):    9418.00   
Peak concurrent requests:                177.00    
Total Token throughput (tok/s):          6486.51   
---------------Time to First Token----------------
Mean TTFT (ms):                          4858.63   
Median TTFT (ms):                        4171.40   
P95 TTFT (ms):                           11222.37  
P99 TTFT (ms):                           11896.16  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.72      
Median TPOT (ms):                        9.85      
P95 TPOT (ms):                           15.04     
P99 TPOT (ms):                           15.96     
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.73      
Median ITL (ms):                         5.23      
P95 ITL (ms):                            7.87      
P99 ITL (ms):                            22.51     
==================================================